#### [infrastructure/aws/dev] Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

terraform
data.aws_caller_identity.current: Reading...
module.role_lambda.aws_iam_role.my_role: Refreshing state... [id=lambda-requests-s3-lambda-role-dev]
module.my_api_gateway.aws_api_gateway_rest_api.my_api_gateway: Refreshing state... [id=s6e8hbg6he]
module.my_bucket.aws_s3_bucket.my_bucket: Refreshing state... [id=lambda-requests-s3-dev]
data.aws_caller_identity.current: Read complete after 0s [id=365270812784]
module.my_api_gateway.aws_api_gateway_resource.my_api_gateway_resource: Refreshing state... [id=ifzl6e]
module.my_api_gateway.aws_api_gateway_deployment.my_deployment: Refreshing state... [id=xh8p31]
module.my_bucket.aws_s3_bucket_server_side_encryption_configuration.example: Refreshing state... [id=lambda-requests-s3-dev]
module.role_lambda.aws_iam_policy.my_policy: Refreshing state... [id=arn:aws:iam::365270812784:policy/lambda-requests-s3-lambda-policy-dev]
module.my_bucket.aws_s3_bucket_versioning.versioning_example: Refreshing state... [id=lambda-requests-s3-dev]
module.my_api_gateway.aws_api_gateway_method.my_api_gateway_method: Refreshing state... [id=agm-s6e8hbg6he-ifzl6e-ANY]
module.role_lambda.aws_iam_role_policy_attachment.iam-policy-attach: Refreshing state... [id=lambda-requests-s3-lambda-role-dev-20230805233220868200000001]
module.lambda_function.aws_lambda_function.my_lambda: Refreshing state... [id=lambda-requests-s3-fn-dev]
module.my_api_gateway.aws_lambda_permission.allow_execution_from_my_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.my_api_gateway.aws_api_gateway_integration.my_lambda_integration: Refreshing state... [id=agi-s6e8hbg6he-ifzl6e-ANY]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.my_lambda will be updated in-place
  ~ resource "aws_lambda_function" "my_lambda" {
        id                             = "lambda-requests-s3-fn-dev"
      ~ tags                           = {
            "stage"   = "dev"
          ~ "version" = "2d09cea" -> "dbbf925"
        }
      ~ tags_all                       = {
          ~ "version" = "2d09cea" -> "dbbf925"
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.my_api_gateway.aws_api_gateway_api_key.api_key will be created
  + resource "aws_api_gateway_api_key" "api_key" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "lambda-requests-s3-api-key-dev"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.my_api_gateway.aws_api_gateway_rest_api.my_api_gateway will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "my_api_gateway" {
      ~ description                  = "by MAD" -> "API Gateway for lambda-requests-s3-api-gw-dev project"
        id                           = "s6e8hbg6he"
      ~ name                         = "lambda-requests-s3-apigw-dev" -> "lambda-requests-s3-api-gw-dev"
        tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.my_api_gateway.aws_api_gateway_usage_plan.usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "usage_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "lambda-requests-s3-api-gw-up-dev"
      + tags_all = (known after apply)

      + api_stages {
          + api_id = "s6e8hbg6he"
          + stage  = "dev"
        }
    }

  # module.my_api_gateway.aws_api_gateway_usage_plan_key.api_key_attachment will be created
  + resource "aws_api_gateway_usage_plan_key" "api_key_attachment" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @madinya, Action: `pull_request`*